"""
Mapas são conhecidos em Python como dicinários
dicionários em Python são representados por " { } "
====================================================================================================================
# Acessando as chaves
receita = {
    'jan': 100,
    'fev': 120,
    'mar': 300,
    'abr': 258,
    'maio': 600
}
for chave in receita:
    print(chave)
print ("**********************")
for chave in receita:
    print(receita[chave])
print ("**********************")
for chave in receita:
    print(f'{chave} : {receita[chave]}' )
print ("**********************")

print(receita.keys())
print ("**********************")
print('Modo Pythonico de se fazer')
for chave in  receita.keys():  ##
    print(receita[chave])
====================================================================================================================
receita = {
    'jan': 100,
    'fev': 120,
    'mar': 300,
    'abr': 258,
    'maio': 600
}
# Acessando os valores
print (receita.values())
print ("**********************")
for valor in receita.values():
    print(valor)
====================================================================================================================
receita = {
    'jan': 100,
    'fev': 120,
    'mar': 300,
    'abr': 258,
    'maio': 600
}
print(receita)
print("**********************")
# Desempacotamento de valores
for chave, valores in receita.items():
    print(f"PAra a chave {chave} o valoe é de {valores}")

print("**********************")
print("LIsta contendo tuplas")
print(receita.items())

print("**********************")
# SOma, maximo, minimo, tamanho, respeitando o tipo de dados dos dados ]
print('Soma  :=-> ', sum(receita.values()))
print('Min   :=-> ', min(receita.values()))
print('Max   :=-> ', max(receita.values()))
print('total :=-> ', len(receita.values()))

====================================================================================================================
====================================================================================================================
====================================================================================================================
====================================================================================================================
====================================================================================================================
====================================================================================================================
====================================================================================================================
====================================================================================================================
"""
